---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarConstraint.NumberOfTargets
source: html/4c6f7b2a-f0a3-02e1-9927-d635b4aeb8b2.htm
---
# Autodesk.Revit.DB.Structure.RebarConstraint.NumberOfTargets Property

Identifies the number of references associated to the rebar handle.

## Syntax (C#)
```csharp
public int NumberOfTargets { get; }
```